bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA324PA.xml
                <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
                    <bitfield caption="JTAG Interface Disable" mask="0x80" name="JTD"/>
                    <bitfield caption="BOD Power Down in Sleep" mask="0x40" name="BODS"/>
                    <bitfield caption="BOD Power Down in Sleep Enable" mask="0x20" name="BODSE"/>
                    <bitfield caption="Pull-up disable" mask="0x10" name="PUD"/>
                    <bitfield caption="Interrupt Vector Select" mask="0x02" name="IVSEL"/>
                    <bitfield caption="Interrupt Vector Change Enable" mask="0x01" name="IVCE"/>
                </register>
                <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1">
                    <bitfield caption="JTAG Reset Flag" mask="0x10" name="JTRF"/>
                    <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
                    <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
                    <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
                    <bitfield caption="Power-on reset flag" mask="0x01" name="PORF"/>
                </register>
                <register caption="Oscillator Calibration Value" name="OSCCAL" offset="0x66" size="1" mask="0xFF">
                    <bitfield caption="Oscillator Calibration " mask="0xFF" name="OSCCAL"/>
                </register>
                <register caption="" name="CLKPR" offset="0x61" size="1" ocd-rw="R">
                    <bitfield caption="" mask="0x80" name="CLKPCE"/>
                    <bitfield caption="" mask="0x0F" name="CLKPS" values="CPU_CLK_PRESCALE_4_BITS_SMALL"/>
                </register>
                <register caption="Sleep Mode Control Register" name="SMCR" offset="0x53" size="1">
                    <bitfield caption="Sleep Mode Select bits" mask="0x0E" name="SM" values="CPU_SLEEP_MODE_3BITS"/>
                    <bitfield caption="Sleep Enable" mask="0x01" name="SE"/>
                </register>
                <register caption="General Purpose IO Register 2" name="GPIOR2" offset="0x4B" size="1">
                    <bitfield caption="General Purpose IO Register 2 bis" mask="0xFF" name="GPIOR" lsb="20"/>
                </register>
                <register caption="General Purpose IO Register 1" name="GPIOR1" offset="0x4A" size="1">
                    <bitfield caption="General Purpose IO Register 1 bis" mask="0xFF" name="GPIOR" lsb="10"/>
                </register>
                <register caption="General Purpose IO Register 0" name="GPIOR0" offset="0x3E" size="1">
                    <bitfield caption="General Purpose IO Register 0 bit 7" mask="0x80" name="GPIOR07"/>
                    <bitfield caption="General Purpose IO Register 0 bit 6" mask="0x40" name="GPIOR06"/>
                    <bitfield caption="General Purpose IO Register 0 bit 5" mask="0x20" name="GPIOR05"/>
                    <bitfield caption="General Purpose IO Register 0 bit 4" mask="0x10" name="GPIOR04"/>
                    <bitfield caption="General Purpose IO Register 0 bit 3" mask="0x08" name="GPIOR03"/>
                    <bitfield caption="General Purpose IO Register 0 bit 2" mask="0x04" name="GPIOR02"/>
                    <bitfield caption="General Purpose IO Register 0 bit 1" mask="0x02" name="GPIOR01"/>
                    <bitfield caption="General Purpose IO Register 0 bit 0" mask="0x01" name="GPIOR00"/>
                </register>
                <register caption="Power Reduction Register0" name="PRR0" offset="0x64" size="1">
                    <bitfield caption="Power Reduction TWI" mask="0x80" name="PRTWI"/>
                    <bitfield caption="Power Reduction Timer/Counter2" mask="0x40" name="PRTIM2"/>
                    <bitfield caption="Power Reduction Timer/Counter0" mask="0x20" name="PRTIM0"/>
                    <bitfield caption="Power Reduction USART1" mask="0x10" name="PRUSART1"/>
                    <bitfield caption="Power Reduction Timer/Counter1" mask="0x08" name="PRTIM1"/>
                    <bitfield caption="Power Reduction Serial Peripheral Interface" mask="0x04" name="PRSPI"/>
                    <bitfield caption="Power Reduction USART0" mask="0x02" name="PRUSART0"/>
                    <bitfield caption="Power Reduction ADC" mask="0x01" name="PRADC"/>
                </register>
            </register-group>
            <value-group caption="" name="CPU_CLK_PRESCALE_4_BITS_SMALL">
                <value caption="1" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
                <value caption="256" name="VAL_0x08" value="0x08"/>
            </value-group>
            <value-group caption="" name="CPU_SLEEP_MODE_3BITS">
                <value caption="Idle" name="IDLE" value="0x00"/>
                <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x01"/>
                <value caption="Power Down" name="PDOWN" value="0x02"/>
                <value caption="Power Save" name="PSAVE" value="0x03"/>
                <value caption="Reserved" name="VAL_0x04" value="0x04"/>
                <value caption="Reserved" name="VAL_0x05" value="0x05"/>
                <value caption="Standby" name="STDBY" value="0x06"/>
                <value caption="Extended Standby" name="ESTDBY" value="0x07"/>
            </value-group>
            <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
                <value value="0x00" caption="8.0 MHz" name="8_0_MHz"/>
            </value-group>
        </module>
    </modules>
    <pinouts>
        <pinout name="DRQFN_44">
            <pin pad="PB5" position="A1"/>
            <pin pad="PB6" position="B1"/>
            <pin pad="PB7" position="A2"/>
            <pin pad="RESET" position="B2"/>
            <pin pad="VCC" position="A3"/>
            <pin pad="GND" position="B3"/>
            <pin pad="XTAL2" position="A4"/>
            <pin pad="XTAL1" position="B4"/>
            <pin pad="PD0" position="A5"/>
            <pin pad="PD1" position="B5"/>
            <pin pad="PD2" position="A6"/>
            <pin pad="PD3" position="A7"/>
            <pin pad="PD4" position="B6"/>
            <pin pad="PD5" position="A8"/>
            <pin pad="PD6" position="B7"/>
            <pin pad="PD7" position="A9"/>
            <pin pad="VCC" position="B8"/>
            <pin pad="GND" position="A10"/>
            <pin pad="PC0" position="B9"/>
            <pin pad="PC1" position="A11"/>
            <pin pad="PC2" position="B10"/>
            <pin pad="PC3" position="A12"/>
            <pin pad="PC4" position="A13"/>
            <pin pad="PC5" position="B11"/>
            <pin pad="PC6" position="A14"/>
            <pin pad="PC7" position="B12"/>
            <pin pad="AVCC" position="A15"/>
            <pin pad="GND" position="B13"/>
            <pin pad="AREF" position="A16"/>
            <pin pad="PA7" position="B14"/>
            <pin pad="PA6" position="A17"/>
            <pin pad="PA5" position="B15"/>
            <pin pad="PA4" position="A18"/>
            <pin pad="PA3" position="A19"/>
            <pin pad="PA2" position="B16"/>
            <pin pad="PA1" position="A20"/>
            <pin pad="PA0" position="B17"/>
            <pin pad="VCC" position="A21"/>
            <pin pad="GND" position="B18"/>
            <pin pad="PB0" position="A22"/>
            <pin pad="PB1" position="B19"/>
            <pin pad="PB2" position="A23"/>
            <pin pad="PB3" position="B20"/>
            <pin pad="PB4" position="A24"/>
        </pinout>
        <pinout name="PDIP_40">
            <pin pad="PB0" position="1"/>
            <pin pad="PB1" position="2"/>
            <pin pad="PB2" position="3"/>
            <pin pad="PB3" position="4"/>
            <pin pad="PB4" position="5"/>
            <pin pad="PB5" position="6"/>
            <pin pad="PB6" position="7"/>
            <pin pad="PB7" position="8"/>
            <pin pad="RESET" position="9"/>
            <pin pad="VCC" position="10"/>
            <pin pad="GND" position="11"/>
            <pin pad="XTAL2" position="12"/>
            <pin pad="XTAL1" position="13"/>
            <pin pad="PD0" position="14"/>
            <pin pad="PD1" position="15"/>
            <pin pad="PD2" position="16"/>
            <pin pad="PD3" position="17"/>
            <pin pad="PD4" position="18"/>
            <pin pad="PD5" position="19"/>
            <pin pad="PD6" position="20"/>
            <pin pad="PD7" position="21"/>
            <pin pad="PC0" position="22"/>
            <pin pad="PC1" position="23"/>
            <pin pad="PC2" position="24"/>
            <pin pad="PC3" position="25"/>
            <pin pad="PC4" position="26"/>
            <pin pad="PC5" position="27"/>
            <pin pad="PC6" position="28"/>
            <pin pad="PC7" position="29"/>
            <pin pad="AVCC" position="30"/>
            <pin pad="GND" position="31"/>
            <pin pad="AREF" position="32"/>
            <pin pad="PA7" position="33"/>
            <pin pad="PA6" position="34"/>
            <pin pad="PA5" position="35"/>
            <pin pad="PA4" position="36"/>
            <pin pad="PA3" position="37"/>
            <pin pad="PA2" position="38"/>
            <pin pad="PA1" position="39"/>
            <pin pad="PA0" position="40"/>
        </pinout>
        <pinout name="QFN_QFP_44">
            <pin pad="PB5" position="1"/>
            <pin pad="PB6" position="2"/>
            <pin pad="PB7" position="3"/>
            <pin pad="RESET" position="4"/>
            <pin pad="VCC" position="5"/>
            <pin pad="GND" position="6"/>
            <pin pad="XTAL2" position="7"/>
            <pin pad="XTAL1" position="8"/>
            <pin pad="PD0" position="9"/>
            <pin pad="PD1" position="10"/>
            <pin pad="PD2" position="11"/>
            <pin pad="PD3" position="12"/>
            <pin pad="PD4" position="13"/>
            <pin pad="PD5" position="14"/>
            <pin pad="PD6" position="15"/>
            <pin pad="PD7" position="16"/>
            <pin pad="VCC" position="17"/>
            <pin pad="GND" position="18"/>
            <pin pad="PC0" position="19"/>
            <pin pad="PC1" position="20"/>
            <pin pad="PC2" position="21"/>
            <pin pad="PC3" position="22"/>
            <pin pad="PC4" position="23"/>
            <pin pad="PC5" position="24"/>
            <pin pad="PC6" position="25"/>
            <pin pad="PC7" position="26"/>
            <pin pad="AVCC" position="27"/>
            <pin pad="GND" position="28"/>
            <pin pad="AREF" position="29"/>
            <pin pad="PA7" position="30"/>
            <pin pad="PA6" position="31"/>
            <pin pad="PA5" position="32"/>
            <pin pad="PA4" position="33"/>
            <pin pad="PA3" position="34"/>
            <pin pad="PA2" position="35"/>
            <pin pad="PA1" position="36"/>
            <pin pad="PA0" position="37"/>
            <pin pad="VCC" position="38"/>
            <pin pad="GND" position="39"/>
            <pin pad="PB0" position="40"/>
            <pin pad="PB1" position="41"/>
            <pin pad="PB2" position="42"/>
            <pin pad="PB3" position="43"/>
            <pin pad="PB4" position="44"/>
        </pinout>
        <pinout name="BGA_49">
            <pin pad="GND" position="A1"/>
            <pin pad="PB4" position="A2"/>
            <pin pad="PB2" position="A3"/>
            <pin pad="GND" position="A4"/>
            <pin pad="VCC" position="A5"/>
            <pin pad="PA2" position="A6"/>
            <pin pad="GND" position="A7"/>
            <pin pad="PB6" position="B1"/>
            <pin pad="PB5" position="B2"/>
            <pin pad="PB3" position="B3"/>
            <pin pad="PB0" position="B4"/>
            <pin pad="PA0" position="B5"/>
            <pin pad="PA3" position="B6"/>
            <pin pad="PA5" position="B7"/>
            <pin pad="VCC" position="C1"/>
            <pin pad="RESET" position="C2"/>
            <pin pad="PB7" position="C3"/>
            <pin pad="PB1" position="C4"/>
            <pin pad="PA1" position="C5"/>
            <pin pad="PA6" position="C6"/>
            <pin pad="AREF" position="C7"/>
            <pin pad="GND" position="D1"/>
            <pin pad="XTAL2" position="D2"/>
            <pin pad="PD0" position="D3"/>
            <pin pad="GND" position="D4"/>
            <pin pad="PA4" position="D5"/>
            <pin pad="PA7" position="D6"/>
            <pin pad="GND" position="D7"/>
            <pin pad="XTAL1" position="E1"/>
            <pin pad="PD1" position="E2"/>
            <pin pad="PD5" position="E3"/>
            <pin pad="PD7" position="E4"/>
            <pin pad="PC5" position="E5"/>
            <pin pad="PC7" position="E6"/>
            <pin pad="AVCC" position="E7"/>
            <pin pad="PD2" position="F1"/>
            <pin pad="PD3" position="F2"/>
            <pin pad="PD6" position="F3"/>
            <pin pad="PC0" position="F4"/>
            <pin pad="PC2" position="F5"/>
            <pin pad="PC4" position="F6"/>
            <pin pad="PC6" position="F7"/>
            <pin pad="GND" position="G1"/>
            <pin pad="PD4" position="G2"/>
            <pin pad="VCC" position="G3"/>
            <pin pad="GND" position="G4"/>
            <pin pad="PC1" position="G5"/>
            <pin pad="PC3" position="G6"/>
            <pin pad="GND" position="G7"/>
        </pinout>
    </pinouts>
</target-description-file>
